api/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    if request.headers["HTTP_PROJECT_HASH"]
      puts "hello"
      @project = set_project
      render json: @project.show
    else
      if user_signed_in?
        @projects = Project.all

SELECT  "projects".* FROM "projects" WHERE "projects"."project_hash" = $1 ORDER BY "projects"."id" ASC LIMIT $2  [["project_hash", "3eazslUzUBY"], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_project
      puts request.headers["HTTP_PROJECT_HASH"]
      if request.headers["HTTP_PROJECT_HASH"]
        @project = Project.where(project_hash: request.headers["HTTP_PROJECT_HASH"]).first
      else
        @project = Project.find(params[:id])